k6/Logs/k6-test/4_Run K6 load test.txt
2025-10-28T21:51:51.9595207Z ##[group]Run grafana/k6-action@v0.3.0
2025-10-28T21:51:51.9595495Z with:
2025-10-28T21:51:51.9595667Z   filename: k6/script.js
2025-10-28T21:51:51.9595865Z   cloud: false
2025-10-28T21:51:51.9596029Z ##[endgroup]
2025-10-28T21:51:51.9710976Z ##[command]/usr/bin/docker run --name bee8baa9044e83b30250dc7dfdadbc_62a917 --label 536036 --workdir /github/workspace --rm -e "INPUT_FILENAME" -e "INPUT_CLOUD" -e "INPUT_TOKEN" -e "INPUT_FLAGS" -e "K6_CLOUD_TOKEN" -e "HOME" -e "GITHUB_JOB" -e "GITHUB_REF" -e "GITHUB_SHA" -e "GITHUB_REPOSITORY" -e "GITHUB_REPOSITORY_OWNER" -e "GITHUB_REPOSITORY_OWNER_ID" -e "GITHUB_RUN_ID" -e "GITHUB_RUN_NUMBER" -e "GITHUB_RETENTION_DAYS" -e "GITHUB_RUN_ATTEMPT" -e "GITHUB_ACTOR_ID" -e "GITHUB_ACTOR" -e "GITHUB_WORKFLOW" -e "GITHUB_HEAD_REF" -e "GITHUB_BASE_REF" -e "GITHUB_EVENT_NAME" -e "GITHUB_SERVER_URL" -e "GITHUB_API_URL" -e "GITHUB_GRAPHQL_URL" -e "GITHUB_REF_NAME" -e "GITHUB_REF_PROTECTED" -e "GITHUB_REF_TYPE" -e "GITHUB_WORKFLOW_REF" -e "GITHUB_WORKFLOW_SHA" -e "GITHUB_REPOSITORY_ID" -e "GITHUB_TRIGGERING_ACTOR" -e "GITHUB_WORKSPACE" -e "GITHUB_ACTION" -e "GITHUB_EVENT_PATH" -e "GITHUB_ACTION_REPOSITORY" -e "GITHUB_ACTION_REF" -e "GITHUB_PATH" -e "GITHUB_ENV" -e "GITHUB_STEP_SUMMARY" -e "GITHUB_STATE" -e "GITHUB_OUTPUT" -e "RUNNER_OS" -e "RUNNER_ARCH" -e "RUNNER_NAME" -e "RUNNER_ENVIRONMENT" -e "RUNNER_TOOL_CACHE" -e "RUNNER_TEMP" -e "RUNNER_WORKSPACE" -e "ACTIONS_RUNTIME_URL" -e "ACTIONS_RUNTIME_TOKEN" -e "ACTIONS_CACHE_URL" -e "ACTIONS_RESULTS_URL" -e GITHUB_ACTIONS=true -e CI=true -v "/var/run/docker.sock":"/var/run/docker.sock" -v "/home/runner/work/_temp/_github_home":"/github/home" -v "/home/runner/work/_temp/_github_workflow":"/github/workflow" -v "/home/runner/work/_temp/_runner_file_commands":"/github/file_commands" -v "/home/runner/work/colibri-app/colibri-app":"/github/workspace" 536036:41bee8baa9044e83b30250dc7dfdadbc  "false" "k6/script.js" ""
2025-10-28T21:51:52.2117916Z 
2025-10-28T21:51:52.2118974Z          /\      Grafana   /‾‾/  
2025-10-28T21:51:52.2121409Z     /\  /  \     |\  __   /  /   
2025-10-28T21:51:52.2121913Z    /  \/    \    | |/ /  /   ‾‾\ 
2025-10-28T21:51:52.2122343Z   /          \   |   (  |  (‾)  |
2025-10-28T21:51:52.2122703Z  / __________ \  |_|\_\  \_____/ 
2025-10-28T21:51:52.2122939Z 
2025-10-28T21:51:52.2142486Z      execution: local
2025-10-28T21:51:52.2143669Z         script: k6/script.js
2025-10-28T21:51:52.2157557Z         output: -
2025-10-28T21:51:52.2157881Z 
2025-10-28T21:51:52.2158299Z      scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
2025-10-28T21:51:52.2159543Z               * default: 10 looping VUs for 30s (gracefulStop: 30s)
2025-10-28T21:51:52.2160051Z 
2025-10-28T21:51:53.2150569Z 
2025-10-28T21:51:53.2151069Z running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
2025-10-28T21:51:53.2151506Z default   [   3% ] 10 VUs  01.0s/30s
2025-10-28T21:51:54.2151391Z 
2025-10-28T21:51:54.2152009Z running (0m02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
2025-10-28T21:51:54.2152622Z default   [   7% ] 10 VUs  02.0s/30s
2025-10-28T21:51:55.2146167Z 
2025-10-28T21:51:55.2146740Z running (0m03.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
2025-10-28T21:51:55.2147177Z default   [  10% ] 10 VUs  03.0s/30s
2025-10-28T21:51:56.2147973Z 
2025-10-28T21:51:56.2148593Z running (0m04.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
2025-10-28T21:51:56.2149104Z default   [  13% ] 10 VUs  04.0s/30s
2025-10-28T21:51:57.2148632Z 
2025-10-28T21:51:57.2151188Z running (0m05.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
2025-10-28T21:51:57.2151601Z default   [  17% ] 10 VUs  05.0s/30s
2025-10-28T21:51:58.2150956Z 
2025-10-28T21:51:58.2151456Z running (0m06.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
2025-10-28T21:51:58.2151865Z default   [  20% ] 10 VUs  06.0s/30s
2025-10-28T21:51:59.2152737Z 
2025-10-28T21:51:59.2153388Z running (0m07.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
2025-10-28T21:51:59.2153895Z default   [  23% ] 10 VUs  07.0s/30s
2025-10-28T21:52:00.2143611Z 
2025-10-28T21:52:00.2144245Z running (0m08.0s), 10/10 VUs, 27 complete and 0 interrupted iterations
2025-10-28T21:52:00.2144769Z default   [  27% ] 10 VUs  08.0s/30s
2025-10-28T21:52:01.2146598Z 
2025-10-28T21:52:01.2147198Z running (0m09.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
2025-10-28T21:52:01.2147685Z default   [  30% ] 10 VUs  09.0s/30s
2025-10-28T21:52:02.2149429Z 
2025-10-28T21:52:02.2150083Z running (0m10.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
2025-10-28T21:52:02.2150874Z default   [  33% ] 10 VUs  10.0s/30s
2025-10-28T21:52:03.2144482Z 
2025-10-28T21:52:03.2145024Z running (0m11.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
2025-10-28T21:52:03.2145458Z default   [  37% ] 10 VUs  11.0s/30s
2025-10-28T21:52:04.2142402Z 
2025-10-28T21:52:04.2143020Z running (0m12.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
2025-10-28T21:52:04.2143517Z default   [  40% ] 10 VUs  12.0s/30s
2025-10-28T21:52:05.2142337Z 
2025-10-28T21:52:05.2142979Z running (0m13.0s), 10/10 VUs, 67 complete and 0 interrupted iterations
2025-10-28T21:52:05.2143542Z default   [  43% ] 10 VUs  13.0s/30s
2025-10-28T21:52:06.2148200Z 
2025-10-28T21:52:06.2148810Z running (0m14.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
2025-10-28T21:52:06.2149294Z default   [  47% ] 10 VUs  14.0s/30s
2025-10-28T21:52:07.2143445Z 
2025-10-28T21:52:07.2144266Z running (0m15.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
2025-10-28T21:52:07.2144988Z default   [  50% ] 10 VUs  15.0s/30s
2025-10-28T21:52:08.2143957Z 
2025-10-28T21:52:08.2144639Z running (0m16.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
2025-10-28T21:52:08.2145262Z default   [  53% ] 10 VUs  16.0s/30s
2025-10-28T21:52:09.2152418Z 
2025-10-28T21:52:09.2153045Z running (0m17.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
2025-10-28T21:52:09.2153529Z default   [  57% ] 10 VUs  17.0s/30s
2025-10-28T21:52:10.2142169Z 
2025-10-28T21:52:10.2143060Z running (0m18.0s), 10/10 VUs, 108 complete and 0 interrupted iterations
2025-10-28T21:52:10.2143671Z default   [  60% ] 10 VUs  18.0s/30s
2025-10-28T21:52:11.2144904Z 
2025-10-28T21:52:11.2145477Z running (0m19.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
2025-10-28T21:52:11.2145896Z default   [  63% ] 10 VUs  19.0s/30s
2025-10-28T21:52:12.2148895Z 
2025-10-28T21:52:12.2149566Z running (0m20.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
2025-10-28T21:52:12.2150145Z default   [  67% ] 10 VUs  20.0s/30s
2025-10-28T21:52:13.2146027Z 
2025-10-28T21:52:13.2146652Z running (0m21.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
2025-10-28T21:52:13.2147144Z default   [  70% ] 10 VUs  21.0s/30s
2025-10-28T21:52:14.2149534Z 
2025-10-28T21:52:14.2150137Z running (0m22.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
2025-10-28T21:52:14.2150871Z default   [  73% ] 10 VUs  22.0s/30s
2025-10-28T21:52:15.2148696Z 
2025-10-28T21:52:15.2149223Z running (0m23.0s), 10/10 VUs, 148 complete and 0 interrupted iterations
2025-10-28T21:52:15.2149684Z default   [  77% ] 10 VUs  23.0s/30s
2025-10-28T21:52:16.2145627Z 
2025-10-28T21:52:16.2146226Z running (0m24.0s), 10/10 VUs, 151 complete and 0 interrupted iterations
2025-10-28T21:52:16.2146614Z default   [  80% ] 10 VUs  24.0s/30s
2025-10-28T21:52:17.2151067Z 
2025-10-28T21:52:17.2151582Z running (0m25.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
2025-10-28T21:52:17.2151985Z default   [  83% ] 10 VUs  25.0s/30s
2025-10-28T21:52:18.2147077Z 
2025-10-28T21:52:18.2147655Z running (0m26.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
2025-10-28T21:52:18.2148092Z default   [  87% ] 10 VUs  26.0s/30s
2025-10-28T21:52:19.2147268Z 
2025-10-28T21:52:19.2147831Z running (0m27.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
2025-10-28T21:52:19.2148262Z default   [  90% ] 10 VUs  27.0s/30s
2025-10-28T21:52:20.2147522Z 
2025-10-28T21:52:20.2148128Z running (0m28.0s), 10/10 VUs, 182 complete and 0 interrupted iterations
2025-10-28T21:52:20.2148596Z default   [  93% ] 10 VUs  28.0s/30s
2025-10-28T21:52:21.2145862Z 
2025-10-28T21:52:21.2146448Z running (0m29.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
2025-10-28T21:52:21.2146978Z default   [  97% ] 10 VUs  29.0s/30s
2025-10-28T21:52:22.2151363Z 
2025-10-28T21:52:22.2151920Z running (0m30.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
2025-10-28T21:52:22.2152364Z default   [ 100% ] 10 VUs  30.0s/30s
2025-10-28T21:52:23.1754899Z 
2025-10-28T21:52:23.1754949Z 
2025-10-28T21:52:23.1755636Z   █ TOTAL RESULTS 
2025-10-28T21:52:23.1755831Z 
2025-10-28T21:52:23.1755932Z     checks_total.......: 630     20.354401/s
2025-10-28T21:52:23.1756213Z     checks_succeeded...: 100.00% 630 out of 630
2025-10-28T21:52:23.1756467Z     checks_failed......: 0.00%   0 out of 630
2025-10-28T21:52:23.1756661Z 
2025-10-28T21:52:23.1756904Z     ✓ Login status 200
2025-10-28T21:52:23.1757291Z     ✓ Login tiene token
2025-10-28T21:52:23.1757680Z     ✓ Booking status 201
2025-10-28T21:52:23.1757901Z 
2025-10-28T21:52:23.1758006Z     CUSTOM
2025-10-28T21:52:23.1758345Z     booking_success................: 210    6.7848/s
2025-10-28T21:52:23.1758817Z     login_success..................: 210    6.7848/s
2025-10-28T21:52:23.1759127Z 
2025-10-28T21:52:23.1759231Z     HTTP
2025-10-28T21:52:23.1759680Z     http_req_duration..............: avg=226.79ms min=84.11ms med=118.16ms max=4.25s p(90)=171.27ms p(95)=306.12ms
2025-10-28T21:52:23.1760227Z       { expected_response:true }...: avg=226.79ms min=84.11ms med=118.16ms max=4.25s p(90)=171.27ms p(95)=306.12ms
2025-10-28T21:52:23.1760881Z     http_req_failed................: 0.00%  0 out of 420
2025-10-28T21:52:23.1761161Z     http_reqs......................: 420    13.569601/s
2025-10-28T21:52:23.1761342Z 
2025-10-28T21:52:23.1761404Z     EXECUTION
2025-10-28T21:52:23.1761720Z     iteration_duration.............: avg=1.45s    min=1.18s   med=1.24s    max=5.49s p(90)=1.4s     p(95)=1.65s   
2025-10-28T21:52:23.1762126Z     iterations.....................: 210    6.7848/s
2025-10-28T21:52:23.1762413Z     vus............................: 10     min=10       max=10
2025-10-28T21:52:23.1762701Z     vus_max........................: 10     min=10       max=10
2025-10-28T21:52:23.1762899Z 
2025-10-28T21:52:23.1762961Z     NETWORK
2025-10-28T21:52:23.1763143Z     data_received..................: 172 kB 5.5 kB/s
2025-10-28T21:52:23.1763410Z     data_sent......................: 57 kB  1.8 kB/s
2025-10-28T21:52:23.1763579Z 
2025-10-28T21:52:23.1763601Z 
2025-10-28T21:52:23.1763605Z 
2025-10-28T21:52:23.1763608Z 
2025-10-28T21:52:23.1763769Z running (0m31.0s), 00/10 VUs, 210 complete and 0 interrupted iterations
2025-10-28T21:52:23.1764164Z default ✓ [ 100% ] 10 VUs  30s